{"created_ts":1604734524000,"modified_ts":1604734524000,"title":"Hacking an RTX 3080","body_markdown":"This season has been insane for PC hardware. Nvidia's new RTX 3000 series lineup is boasting rarely-seen performance at a fraction of the cost. I've had my mind set on doing an [SFFPC](https://www.reddit.com/r/sffpc/) build at some point, and found a fantastic [case](https://ncases.com/products/m1) that should easily accommodate an [RTX 3080 Founder's Edition](https://www.nvidia.com/en-us/geforce/graphics-cards/30-series/rtx-3080/). This sleek card was set to sell at [$300 less than a RTX 2080ti](https://www.tomsguide.com/news/nvidia-Rrtx-3080-vs-rtx-2080-ti#:~:text=RTX%202080%20Ti%3A%20Price%20and,has%20the%20older%20card%20beat.) while offering a [20-45% increase in performance](https://assets.rockpapershotgun.com/images/2020/09/RTX-3080-vs-2080-Ti-4K-ultra-benchmarks.jpg) - an obvious choice for the average consumer.\n\n**Stock Issues**\n\nFrom day one of the release, this card has been consistently sold out and is nearly impossible to obtain. Ebay scalpers are having a hayday by selling cards for 3 to 4 times more than MSRP. As previously mentioned, it seems many people agree that the value for computing power is too good to pass up, and Nvidia is unable to keep up with demand.\n\nWith demand and the opportunity to profit, less ethical hackers began frantically [pushing out software to place orders for them](https://www.eteknix.com/nvidia-apologizes-3080-going-out-of-stock/) when stock became available. Nvidia either wasn't able or wasn't willing to implement a system to prevent these sales (IE [reCAPTCHA](https://www.google.com/recaptcha/about/)). _To be fair, why would they? A sale is a sale - hard to blame them_. However, to circumvent traffic and logistics issues, Nvidia [pushed the responsibility](https://www.techradar.com/news/nvidia-admits-defeat-with-rtx-3080-and-3090-founders-edition-stock-passes-baton-to-best-buy) to a single retailer in the US - Best Buy.\n\nThis is good news, right? A large online retailer such as Best Buy would clearly already have measures in place to solve the problems Nvidia was facing, right? Right...? You've probably guessed by now - that isn't what happened. Frankly, the issues may be even be worse due to Best Buy's various [sporadic and widespread failures](https://www.reddit.com/r/nvidia/comments/jjvig1/3080_fe_available_on_best_buy/) throughout the multi-step ordering process. At face value, there is still nothing in place to prevent automated orders from being placed.\n\n**The 'Solution'**\n\nIf you can't beat them, join them! Okay, not really... once again, I am plagued by an overbearing urge to not use my skills for evil.\n\nAside from reliability, Best Buy actually has a very nice API. The frontend does what it should and makes requests (item info & stock / add to cart / checkout, etc) using the API. It would be all too easy to make all of the necessary requests to place an order immediately when stock is available. However, I'm not quite ready to see myself become the villain.\n\nAs a compromise, I limited my hacking to focus only on the endpoint that (given a sku) returns that item's stock status. As far as I know, there is only one flag that I'm interested in: `buttonState: SOLD_OUT`. The premise is simple enough, make a request every `x` seconds (randomized) to see if this flag has changed - if it has, send an email to notify. The program also logs each result, so a terminal can be monitored in real-time.\n\n**Reinventing the wheel?**\n\nIt's not unfair to say that this problem already has a solution. There are [stock-checkers available online](https://www.nowinstock.net/computers/videocards/nvidia/rtx3080/) that are free to use. I haven't looked into them much but I've seen that higher-interval tools require paid plans and have browser dependencies. The goal for me is to outperform these tools if possible - implementing my own solution will allow me to finely tune my intervals to as low as possible while still avoiding detection. Besides, this is a fun project!\n\n**Challenges**\n\nTruthfully, there's not a lot to talk about here. Best Buy's API expects certain request headers to be set or else it will return a 400 error code. Finding the relevant headers was a trivial case of trial and error. Everything else worked exactly as expected. I opted to use [`node-fetch`](https://github.com/node-fetch/node-fetch) for the requests to the API, and [`gmail-send`](https://github.com/alykoshin/gmail-send) to send myself an email when the stock is no longer listed as `SOLD_OUT`.\n\n**Code**\n\nI'll just drop this in as a [gist](https://gist.github.com/d-r-w/2b5071a2d54f6ca83ca561a9df7ba1a3) for those who may be interested.\n\n**The Outcome**\n\nThis is the part where I'd _love_ to say that the initiative paid off in the end and I secured myself a graphics card that is borderline impossible to obtain. Alas, things don't always work out as expected.\n\nAt the time of writing this post, the stock status has changed only a single time in three weeks. I have been monitoring the logs as much as could be considered as only slightly unhealthy. The one time the stock did change, I (sadly) wasn't actively using a device that would have notified me. I missed the notification by about 90 seconds. I was still able to begin the ordering process, but others were notified by their services by then and the API was behaving too erratically for my order to be placed successfully.\n\nI'm painfully aware that it's not the most exciting outcome, but I am grateful for the opportunity that presented itself to me. There is great enjoyment in writing fulfilling code that serves a real-world purpose, even if it hasn't quite found its moment to produce results - and I am still running currently running the program (wish me luck!).","_id":"2AjejodDJK"}
{"created_ts":1623640951946,"modified_ts":1623640951946,"title":"SFF PC Build","body_markdown":"I guess it's far past time for an update on the RTX 3080FE - the alerting project resulted in a massive success! I was able to secure both the coveted graphics card **and** a Ryzen 5900x in a single order.\n\nI had a great time building my first computer-\n\nHere are some photos of the (honestly insane) build:\n\n<img src=\"https://i.imgur.com/2O5UnJ4.jpg\" width=\"100%\">\n<img src=\"https://i.imgur.com/Gmk1YCb.jpg\" width=\"100%\">\n<img src=\"https://i.imgur.com/PXfksda.jpg\" width=\"100%\">\n<img src=\"https://i.imgur.com/i7GGmwz.jpg\" width=\"100%\">\n\n","_id":"2ecet86aqABKTj01"}
{"created_ts":1595089968792,"modified_ts":1595089968792,"title":"First post!","body_markdown":"This is my first published blog post. Well, it’s not actually published quite yet because this post is about building the blogging platform itself!\n\nMy personal hobby of a website is currently hosted with nodejs on a raspberry pi in my home. I’m aware that this setup isn’t the best idea, and is very possibly a bad idea...but it is fun. Not only do I save on hosting costs, I get the fulfillment of building my own solutions and getting some experience as I go.\n\nI’m considering building a basic CMS - nothing crazy, just a relatively simple way to load and display posts like these. To reduce complexities, this should be the main engine of my website. This wouldn’t be my first time building something similar to a CMS - one of my first ever websites (think Geocities days) implemented something like this. I’m not sure there was even a name for it back then. That’s not to imply that the idea was new, several places on the internet were doing similar things (pretty sure I got the idea from Xanga). A more resilient example would probably be Blogger.\n\nNode is a preference for this project because it’s so simple to spin anything up. Even now, I’m hosting a landing page using only a few lines of code. My hopes are to build upon this in an effort to make pushing out blog posts like these easier.\n\nThe idea is pretty straightforward...have the node webserver pull blog posts from a nosql database and render HTML to style the blog posts.\n\n- [Express](https://expressjs.com/)\n- [EJS](https://ejs.co/)\n - React/similar seems to be a bit over-the-top, but backend templating should be clean and not overly convoluted\n- [Marked.js](https://marked.js.org/) to format blog posts and make storing them simple and inexpensive\n- [neDB](https://github.com/louischatriot/nedb)\n - Prefer NoSQL for this, and embedded is preferred (less moving parts on the Pi is inevitably for the best)\n\n_Sidenote: I’m finally switching to [vscode](https://code.visualstudio.com/). I finally got around to testing it out on my hackbook (cheap little chromebook) and it runs surprisingly well. I’m ashamed for not switching sooner. Due to its superb git integration, switching also affords me the ability to drop the fancy graphical git tools I’ve been using._\n\n### Express ###\n\nSet up an HTTP server, handle requests. Interface with EJS to render HTML, interface with database to load posts.\n\n### Database ###\nI have some experience with neDB, and think it will be a perfect fit for this project. The lack of binaries and dependencies keep everything very simple. I’m thinking (for now) I’ll just more or less make a flat file of `posts`. Each post would have a `created_ts`, `modified_ts`, `title`, and `markdown_body`. neDB is great on its own, but I’d like to use a promisified version of it - for that I’ll use the package [`nedb-promises`](https://github.com/bajankristof/nedb-promises) - this will allow me to use async/await instead of callbacks. I think that’s really all there is to say about the database, nothing fancy.\n\n### Marked.js ###\nAnother simple idea. Store markdown directly in the database so fancy formatting can be applied during rendering using a call to `marked()`. Stylings can be applied during rendering.\n\n### EJS ###\nThis is probably the most complicated bit, but only due to the fact that rendering the HTML and CSS was likely always going to be the most complicated part of this project. It would be easy enough to just render some basic HTML along with serving static files, but I think a good way to keep everything tidy and uniform will be using EJS. That being said, it’s still _really_ not complicated at all. Just throwing some loops and formatting into a `.ejs` file and calling it good. Bootstrap is sort of a cop out, but it’s undeniably simple. I’ll just pull from a CDN and apply some basic formatting.\n\n### The Future ###\nIdeally, this is a very rough version of what I hope to be a portfolio website. There are some pretty glaring issues at this point, mostly that there’s no real landing page and the index page is just displaying every post. Obviously it makes a lot more sense to group posts by date, maybe show last x posts as cards with a snippet of the content (definitely not the entire body).\n\nThe current working version is pretty lightweight, but the code is as well - I'm ruling it a success.\n\nCheck out the code at:\n### [https://github.com/d-r-w/dwhite-codes](https://github.com/d-r-w/dwhite-codes) ###","_id":"At3WI6HESEpKwHJD"}
{"created_ts":1611548786513,"modified_ts":1611548786513,"title":"First Mobile Post!","body_markdown":"I'm using my phone to publish a post!","_id":"Krys6v62o2TrZpWn"}
{"created_ts":1611530439896,"modified_ts":1611530439896,"title":"Publishing Posts","body_markdown":"I need a less cumbersome way to publish posts. There's nothing significantly _wrong_ with what I'm doing now, but it's certainly not the best way to go about it.\n\nI want the ability to edit and see the markdown live. I also want a way to supply credentials and just insert the post directly into the database from the website itself. \n\n##### Live Preview\nI think a simple way to go about this will be simply sending a `fetch` request to a new `marked.json` endpoint where the server can just do a call to `marked()` and send the returned value in a response. This can be triggered with an `oninput` attribute attached to a `textarea`.\n\n##### Publishing\nPerhaps not the best way to go about it, but having a \"post title\" text input, \"key\" text input, and \"submit\" button would likely do the trick. The button will have an `onclick` event attribute that will perform a `fetch` call to `publish_post.json`. Normally this would be fine with HTTPs, but there is a concern that this isn't currently implemented on my server.. I should probably look into that. Because this will be sent in HTTP, there's potential for bad actors on the network to see the key in cleartext and add nefarious posts to the database. I'll take the risk for now but I do want to keep this on the radar. The key will be set on the server with a `process.env` variable. If the key matches, the post will be added. Otherwise, a `403` HTTP status code will be returned.","_id":"TWO6mKmDtJFgSOEy"}
{"created_ts":1611530265782,"modified_ts":1611530265782,"title":"Nixing EJS Rendering","body_markdown":"##### The problem\nI'm quickly discovering that I'm just not a fan of using EJS rendering for this project website.\nI understand the typical use cases for it, but I'm finding myself making flexibility\nsacrifices that I wouldn't normally have to make if I were sticking to vanilla javascript.\n\n\n##### The Solution\nI want to build an endpoint that is separate from the view in a way that makes the site robust and more interactive than what boils down to being\na static render. Yes, the initial rendering of the content is amazingly simple, but I'm struggling to make that content interactive. I would argue that an\nalternate implementation that involves fetching from a JSON endpoint isn't even more complex - the results still need to be transformed similarly as they\nare with EJS, albeit in a much less \"behind-the-scenes\" manner.\n\n\n##### The Implementation\nOn the server, this actually requires only a few small changes-\nFirstly, I want to set a default index page:\n\n`app.use(express.static('static', { index: 'index.html' }));`\n\n\nThis page will be used later to load posts with a `fetch()` call.\n\nNext, I want to make a `posts.json` endpoint. This endpoint will allow fields to be specified in a GraphQL-esque manner for instances where full post\ninformation isn't required. I'm not sure if it will ever be used, but it's free to do:\n\n    app.get('/posts.json', async (req, res) => {\n      let posts;\n      let limit = req.query.limit ? req.query.limit : 500;\n      let target_fields = req.query.fields ?\n        req.query.fields.split(',').reduce((o, field) => (o[field] = 1) && o, {}) : {};\n    \n      try {\n        posts = (await db.find({}, target_fields).sort({ created_ts: -1 }).limit(limit))\n          .map(post => {\n            if(post.body_markdown) {\n              post.body_markdown = marked(post.body_markdown);\n            }\n            return post;\n          });\n    \n        res.json(posts);\n      }\n      catch(error) {\n        console.error(error);\n        res.sendStatus(500);\n      }\n    });\n\nI've also added some logic to sort posts by most recent publications and the ability to limit the result set.\n\nAs aforementioned, the only thing left to do to restore original functionality is to replace the EJS templating with\na call to `fetch()` that results in the posts container being populated:\n\n    let populate_latest_posts = async () => {\n      let latest_posts_div = document.getElementById('latest_posts');\n      let posts = await (await fetch('/posts.json?limit=5')).json();\n      let add_post = post => {\n        let title_h2 = document.createElement('h2');\n        title_h2.textContent = post.title;\n        latest_posts_div.appendChild(title_h2);\n\n        let post_body_div = document.createElement('div');\n        post_body_div.innerHTML = post.body_markdown;\n        latest_posts_div.appendChild(post_body_div);\n      }\n      posts.forEach(add_post);\n    };\n\n##### Conclusion\nWith that, the site behaves exactly as before, but hopefully this new setup will allow me to do things like modifying and adding posts directly, adding preview tiles, and other features that I may desire in the future.","_id":"kNwFlePVkdxD5vKf"}
{"created_ts":1660941527645,"modified_ts":1660941527645,"title":"Installing SSL Certificate to Enable HTTPs","body_markdown":"I've been putting it off for quite some time, but I finally got around to getting HTTPs up and running for this site. The process was actually very simple (comparing this to just a few years ago).\n\n##### Certbot #####\nTo get my certificate, I used a service called [certbot](https://certbot.eff.org/). There are a few guides for this, but I found that many of them were too specific to meet my needs (in regards hardware, OS, and hosting software).\n\nTo install certbot on my RPI1 Pi Zero Wireless, I simply used apt with a remote shell:\n\n`sudo apt install certbot`\n\nThe install went exactly as expected. Certbot has the ability to complete challenges using vague solution-agnostic static hosting\n, which works perfectly for my setup:\n\n`sudo certbot certonly --standalone`\n\nAll I needed to do was work through the interactive application to provide some details and point it to the proper directory so it could serve and complete the challenge. Certbot installed the certificate and private key directly to the server with path information used to update the node server to actually use HTTPs.\n\nWhile I was at it, I also updated the server application to forcefully upgrade HTTP connections to HTTPs. The changes in full can be seen [here](https://github.com/d-r-w/dwhite-codes/compare/932655cb0c9c7f5277b67a8c9477658e80acb36c..b17e9612ee8a35f1e1f09c3e6962bbfc7c6e32b0).\n\nAll in all, I'm absolutely astonished at how easy it is to enable HTTPs these days. \n\n","_id":"hBEF734TXWEscWKU"}
{"created_ts":1662043627554,"modified_ts":1662043627554,"title":"Addressing Humidity with Home Automation Hacks","body_markdown":"##### Humidity\nEver since moving to Texas, I've had quite the battle against household humidity (*55%+!*). More often than not, it's more humid inside than it is outside. What's the deal? \n\n##### Auxiliary Dehumidifier\nThis seemed like the most obvious solution to the problem, far before I knew anything about *short-cycling*. If the air is too humid, get a separate dehumidifier to address the issue. Without hesitation, I purchased a fantastic 3000sqft [dehumidifier from Amazon](https://www.amazon.com/gp/product/B06X9MFTZZ/). The unit is rated at double the actual space considering that my humidity level is pretty extreme.\n\nThe unit itself works great and does exactly what it's supposed to, with some major caveats:\n- Runs non-stop trying to reach the set humidity level (as is proper in my scenario)\n-Uses just as much electricity as the AC itself (paired with the above, this doubled my electricity bill)\n-Constantly drawing water from the air meant that it constantly needed to be emptied (sometimes multiple times daily)\n\n**This is where I realized that removing 3 gallons of water from the air every single day is not a normal thing to be doing**.\n\nAt this point, I started to think about *why* this is happening as opposed to what to do about it. After a lot of research, I found that there were a few things causing the issue. The easiest of those to address was making sure that the blower fan only turned on when the AC unit is on - this is something that is very situational but in my case Google Nest will run the fan in an attempt to not run the AC unit as much. Sometimes this makes sense, but in my case it was adding to the problem.\n\nChanging some Google Nest settings certainly helped, but only by a narrow margin.\n\n##### Short-Cycling?\nFurther research led me to the discovery that my AC would only run for 5 to 10 minutes (sometimes less), as that's how long it took to get the house back down to the set temperature. It is generally agreed that an AC should run for at *least* 15 minutes to function properly. This is called **short-cycling**. When an AC short-cycles, it both doesn't run long enough to remove humidity from the air and consumes excess energy from constantly starting up.\n\nWhy is this happening? In my case, I've determined that the AC unit is oversized and the furnace blower is far too strong. Very cold air is blasted into my 1200sqft house, cooling the entire space too quickly.\n\n##### Solutions\n**New AC / Furnace / Fan** - The most obvious (and probably best) solution is to downsize units - a simple solution with a hefty price tag. For the time being, I'd like to avoid this.\n\n**Lowering Blower Speed** - An interesting one, but it's actually pretty [simple to change the speed at which the fan blows (rewiring required)](https://www.youtube.com/watch?v=f79rrGsWNvM). I quite like this solution, but I don't like the idea of crawling around in a 130F attic to get the job done.\n\n**???** - \n\n##### Home Automation\nQuite some time has passed, and I haven't actually done anything. I unplugged the dehumidifier because it used too much electricity (again, properly - fantastic product). This week, the house has been sitting at 60% humidity.\n\nYesterday, I randomly had the idea of **forcing** the AC to run longer. Why not? Google Nest doesn't really have the software to support this (aside from static schedules that would be very inflexible) but Samsung SmartThings (something I already use) has some amazing control over IoT devices and automation.\n\nIn my case, it doesn't look like there's any way to set up an automation that says \"if the AC is running, make sure it runs for 20 minutes\". That's a bummer, but I created a workaround that works great:\n![SmartThings Automation](https://i.imgur.com/u8LJUAh.png)\n\nBasically, this automation will set the thermostat to 73F (down from 78F) if the humidity is at 52% or higher. Setting the thermostat to 73F is a way to ensure that it will run for a long time trying to reach that temperature.\n\nThat works great, but I don't actually want to run the AC until it reaches 73F. I want it to stop after 20 minutes regardless of the temperature and humidity:\n![SmartThings Automation](https://i.imgur.com/VA7lL5S.png)\n\nBecause no one in my house would ever set the thermostat to 73F manually, I can use this value as a trigger - if the thermostat has been set to 73F for 20 minutes, set it back to 78F.\n\n##### Results\n![Results](https://i.imgur.com/uuOa0xX.png)\nDoes it work? Yes and no. The house is *much* less humid now, but those 20 minutes of runtime really adds quite the temperature swing inside the house.\n\nIt's definitely better than what I was doing previously (nothing), but I imagine I'll eventually be making a trip to the attic to change the blower speed.\n\n","_id":"pUzgZJDrKF3nidOh"}
